In [1]:
# Librerias necesarias 
import pandas as pd

In [2]:
df_0 = pd.DataFrame(
    {
        "name" : [
            "Juan Antonio",
            "Josefino Primera",
            "Ruperto Segundo",
            "Eustoquia Buroz",
        ],
        "age" : [22, 33, 44, 55,],
        "sex" : ["male", "male","male", "female",],
    }
)

In [3]:
df_0 # muestra el Data Frame

               name  age     sex
0      Juan Antonio   22    male
1  Josefino Primera   33    male
2   Ruperto Segundo   44    male
3   Eustoquia Buroz   55  female

In [4]:
df_0['name'] # cada columna es una serie de datos

0        Juan Antonio
1    Josefino Primera
2     Ruperto Segundo
3     Eustoquia Buroz
Name: name, dtype: object

In [5]:
# forma del df fila x columna
df_0.shape
# 0, 1
# (fila, columna)

(4, 3)

In [6]:
# acceder a filas y columnas
df_0.shape[1]

3

In [7]:
# Descripcion estadistica sencilla
df_0['name'].describe()

count                4
unique               4
top       Juan Antonio
freq                 1
Name: name, dtype: object

In [8]:
# ver los primeros n valores (por defecto los primeros 5)
df_0.head(2)

               name  age   sex
0      Juan Antonio   22  male
1  Josefino Primera   33  male

In [9]:
# ver los ultimos n valores (filas)
df_0.tail()

               name  age     sex
0      Juan Antonio   22    male
1  Josefino Primera   33    male
2   Ruperto Segundo   44    male
3   Eustoquia Buroz   55  female

In [10]:
df_0['age'].max()

55

In [11]:
# Leer un archivo
import pandas as pd
df_titanic = pd.read_csv("Titanic-Dataset.csv")

In [12]:
df_titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [13]:
# Tipo de dato de cada columna
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [14]:
df_titanic.shape

(891, 12)

In [15]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
df_titanic['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64